var store = [{
        "title": "intro",
        "excerpt":"안녕하세요! 시작하면서 kniz 라고 합니다. Namu 언어(이하 namulang)를 배우기로 결심하셨군요. 이 곳은 namulang을 사용하기 위한 모든 지식을 얻기 위한 출발점입니다. 게다가 모든 여정은 한글로 작성되었습니다. 만세! 어디서부터 시작해야 할지 난감하실텐데요, 밑에 나오는 목록을 위에서부터 아래로 문서를 차근차근 읽으면 됩니다.쉽죠? 아, 혹시 이미 다른 프로그래밍 언어를 배워본 경험이 있다면 quick start...","categories": [],
        "tags": [],
        "url": "/guide/",
        "teaser": null
      },{
        "title": "quick start",
        "excerpt":"미리 모든 내용을 훑어보죠. 시작하기전에 어떤 분은 프로그래밍 언어를 많이 접해봐서, 아래 내용만으로도 어떠한 언어고 어떻게 사용하면 되는지 깨닫는 분도 있을 거예요. 그런 분들은 필요한 항목만 추가로 열람하고 자유롭게 이곳을 떠나셔도 좋습니다. 혹, 난 그게 아니구나 싶으시다면, 아래 내용들이 좀 혼란스러울 수 있어요. 하지만 어짜피 다시 자세하게 다룰 예정이니까 좀...","categories": [],
        "tags": [],
        "url": "/guide/quick-start",
        "teaser": null
      },]
